zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lfss.h
/*! @enum DL_LFSS_HEARTBEAT_MODE
 *  @brief 心跳发生器工作模式枚举
 */
typedef enum {
    /*! Heart beat generator mode is disabled 禁用心跳发生器 */
    DL_LFSS_HEARTBEAT_MODE_DISABLED = LFSS_HEARTBEAT_HBMODE_HB_DIS,
    /*! Heart beat generator mode is always enabled 始终使能心跳 */
    DL_LFSS_HEARTBEAT_MODE_ALWAYS_ON = LFSS_HEARTBEAT_HBMODE_HB_ALLWAYS,
    /*! Heart beat generator mode is enabled when time stamp event is detected
     *  检测到时间戳事件时使能心跳 */
    DL_LFSS_HEARTBEAT_MODE_TIME_STAMP = LFSS_HEARTBEAT_HBMODE_HB_TS,
    /*! Heart beat generator mode is enabled when the main power supply fails
     *  主电源失效时使能心跳 */
    DL_LFSS_HEARTBEAT_MODE_POWER_FAIL = LFSS_HEARTBEAT_HBMODE_HB_VDDFAIL,
} DL_LFSS_HEARTBEAT_MODE;

/*! @enum DL_LFSS_TAMPERIO_IIDX
 *  @brief 防篡改 IO 中断索引枚举，用于读取最高优先级待处理中断
 */
typedef enum {
    /*! LFSS Tamper interrupt index for Tamper IO 0 防篡改 IO 0 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_0 = LFSS_CPU_INT_IIDX_STAT_TIO0,
    /*! LFSS Tamper interrupt index for Tamper IO 1 防篡改 IO 1 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_1 = LFSS_CPU_INT_IIDX_STAT_TIO1,
    /*! LFSS Tamper interrupt index for Tamper IO 2 防篡改 IO 2 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_2 = LFSS_CPU_INT_IIDX_STAT_TIO2,
    /*! LFSS Tamper interrupt index for Tamper IO 3 防篡改 IO 3 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_3 = LFSS_CPU_INT_IIDX_STAT_TIO3,
    /*! LFSS Tamper interrupt index for Tamper IO 4 防篡改 IO 4 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_4 = LFSS_CPU_INT_IIDX_STAT_TIO4,
    /*! LFSS Tamper interrupt index for Tamper IO 5 防篡改 IO 5 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_5 = LFSS_CPU_INT_IIDX_STAT_TIO5,
    /*! LFSS Tamper interrupt index for Tamper IO 6 防篡改 IO 6 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_6 = LFSS_CPU_INT_IIDX_STAT_TIO6,
    /*! LFSS Tamper interrupt index for Tamper IO 7 防篡改 IO 7 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_7 = LFSS_CPU_INT_IIDX_STAT_TIO7,
    /*! LFSS Tamper interrupt index for Tamper IO 8 防篡改 IO 8 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_8 = LFSS_CPU_INT_IIDX_STAT_TIO8,
    /*! LFSS Tamper interrupt index for Tamper IO 9 防篡改 IO 9 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_9 = LFSS_CPU_INT_IIDX_STAT_TIO9,
    /*! LFSS Tamper interrupt index for Tamper IO 10 防篡改 IO 10 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_10 = LFSS_CPU_INT_IIDX_STAT_TIO10,
    /*! LFSS Tamper interrupt index for Tamper IO 11 防篡改 IO 11 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_11 = LFSS_CPU_INT_IIDX_STAT_TIO11,
    /*! LFSS Tamper interrupt index for Tamper IO 12 防篡改 IO 12 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_12 = LFSS_CPU_INT_IIDX_STAT_TIO12,
    /*! LFSS Tamper interrupt index for Tamper IO 13 防篡改 IO 13 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_13 = LFSS_CPU_INT_IIDX_STAT_TIO13,
    /*! LFSS Tamper interrupt index for Tamper IO 14 防篡改 IO 14 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_14 = LFSS_CPU_INT_IIDX_STAT_TIO14,
    /*! LFSS Tamper interrupt index for Tamper IO 15 防篡改 IO 15 中断索引 */
    DL_LFSS_TAMPERIO_IIDX_TAMPER_IO_15 = LFSS_CPU_INT_IIDX_STAT_TIO15,
} DL_LFSS_TAMPERIO_IIDX;

/*! @enum DL_LFSS_SCRATCHPAD_MEM_WORD
 *  @brief 便签存储器字索引枚举，每字 32 位
 */
typedef enum {
    /*! LFSS Scratch Pad memory word 0 便签存储器字 0 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_0 = 0x0000,
    /*! LFSS Scratch Pad memory word 1 便签存储器字 1 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_1 = 0x0001,
    /*! LFSS Scratch Pad memory word 2 便签存储器字 2 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_2 = 0x0002,
    /*! LFSS Scratch Pad memory word 3 便签存储器字 3 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_3 = 0x0003,
    /*! LFSS Scratch Pad memory word 4 便签存储器字 4 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_4 = 0x0004,
    /*! LFSS Scratch Pad memory word 5 便签存储器字 5 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_5 = 0x0005,
    /*! LFSS Scratch Pad memory word 6 便签存储器字 6 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_6 = 0x0006,
    /*! LFSS Scratch Pad memory word 7 便签存储器字 7 */
    DL_LFSS_SCRATCHPAD_MEM_WORD_7 = 0x0007,
} DL_LFSS_SCRATCHPAD_MEM_WORD;

/*! @enum DL_LFSS_SCRATCHPAD_MEM_BYTE
 *  @brief 便签存储器字节偏移枚举，每字含 4 字节
 */
typedef enum {
    /*! LFSS Scratch Pad memory byte 0 of the given Scratch Pad memory word
     *  便签存储器字内字节 0 */
    DL_LFSS_SCRATCHPAD_MEM_BYTE_0 = 0x0000,
    /*! LFSS Scratch Pad memory byte 1 of the given Scratch Pad memory word
     *  便签存储器字内字节 1 */
    DL_LFSS_SCRATCHPAD_MEM_BYTE_1 = 0x0001,
    /*! LFSS Scratch Pad memory byte 2 of the given Scratch Pad memory word
     *  便签存储器字内字节 2 */
    DL_LFSS_SCRATCHPAD_MEM_BYTE_2 = 0x0002,
    /*! LFSS Scratch Pad memory byte 3 of the given Scratch Pad memory word
     *  便签存储器字内字节 3 */
    DL_LFSS_SCRATCHPAD_MEM_BYTE_3 = 0x0003,
} DL_LFSS_SCRATCHPAD_MEM_BYTE;

/*! @enum DL_LFSS_IWDT_CLOCK_DIVIDE
 *  @brief 独立看门狗(IWDT)时钟分频枚举
 */
typedef enum {
    /*! WDT Clock divide by 1 看门狗时钟 1 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_1 = 0x00000000,
    /*! WDT Clock divide by 2 看门狗时钟 2 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_2 = 0x00000001,
    /*! WDT Clock divide by 3 看门狗时钟 3 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_3 = 0x00000002,
    /*! WDT Clock divide by 4 看门狗时钟 4 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_4 = 0x00000003,
    /*! WDT Clock divide by 5 看门狗时钟 5 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_5 = 0x00000004,
    /*! WDT Clock divide by 6 看门狗时钟 6 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_6 = 0x00000005,
    /*! WDT Clock divide by 7 看门狗时钟 7 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_7 = 0x00000006,
    /*! WDT Clock divide by 8 看门狗时钟 8 分频 */
    DL_LFSS_IWDT_CLOCK_DIVIDE_8 = 0x00000007
} DL_LFSS_IWDT_CLOCK_DIVIDE;

/*! @enum DL_LFSS_IWDT_TIMER_PERIOD
 *  @brief 独立看门狗定时器周期枚举，值越大超时时间越长
 */
typedef enum {
    /*! WDT 2^6 timer period count 看门狗定时周期 2^6 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_6_BITS = LFSS_WDTCTL_PER_PER_EN_6,
    /*! WDT 2^8 timer period count 看门狗定时周期 2^8 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_8_BITS = LFSS_WDTCTL_PER_PER_EN_8,
    /*! WDT 2^10 timer period count 看门狗定时周期 2^10 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_10_BITS = LFSS_WDTCTL_PER_PER_EN_10,
    /*! WDT 2^12 timer period count 看门狗定时周期 2^12 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_12_BITS = LFSS_WDTCTL_PER_PER_EN_12,
    /*! WDT 2^15 timer period count 看门狗定时周期 2^15 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_15_BITS = LFSS_WDTCTL_PER_PER_EN_15,
    /*! WDT 2^18 timer period count 看门狗定时周期 2^18 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_18_BITS = LFSS_WDTCTL_PER_PER_EN_18,
    /*! WDT 2^21 timer period count 看门狗定时周期 2^21 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_21_BITS = LFSS_WDTCTL_PER_PER_EN_21,
    /*! WDT 2^25 timer period count 看门狗定时周期 2^25 计数 */
    DL_LFSS_IWDT_TIMER_PERIOD_25_BITS = LFSS_WDTCTL_PER_PER_EN_25
} DL_LFSS_IWDT_TIMER_PERIOD;

/* clang-format on */

/**
 *  @brief      Enable output inversion for the specified Tamper IO
 *              使能指定防篡改 IO 的输出反转
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO.
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableOutputInversion(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 置位 OUTINV 位使能输出反转
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] |=
        LFSS_TIOCTL_OUTINV_ENABLE;
}

/**
 *  @brief      Checks if output inversion is enabled for the specified Tamper IO
 *              检查指定防篡改 IO 的输出反转是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     Returns if output inversion is enabled
 *              返回输出反转使能状态
 *
 *  @retval     true  Output inversion for the Tamper I/O is enabled 输出反转已使能
 *  @retval     false Output inversion for the Tamper I/O is disabled 输出反转已禁用
 */
__STATIC_INLINE bool DL_LFSS_TamperIO_isOutputInversionEnabled(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 OUTINV 位并与使能值比较
    return ((lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
                LFSS_TIOCTL_OUTINV_MASK) == LFSS_TIOCTL_OUTINV_ENABLE);
}

/**
 *  @brief      Disable output inversion for the specified Tamper IO
 *              禁用指定防篡改 IO 的输出反转
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableOutputInversion(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 清除 OUTINV 位禁用输出反转
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &=
        ~(LFSS_TIOCTL_OUTINV_MASK);
}

/**
 *  @brief      Selects the source for the tamper output (TOUT) control for
 *              the specified Tamper IO
 *              设置指定防篡改 IO 的输出源
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 *  @param[in]  source    The source for the tamper output control.
 *                        One of @ref DL_LFSS_TAMPERIO_OUTPUT_SOURCE.
 *                        输出源选择
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setOutputSource(LFSS_Regs *lfss,
    DL_LFSS_TAMPERIO tamperIO, DL_LFSS_TAMPERIO_OUTPUT_SOURCE source)
{
    // 用 TOUTSEL 掩码更新输出源选择位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO],
        (uint32_t) source, LFSS_TIOCTL_TOUTSEL_MASK);
}

/**
 *  @brief      Gets the source for the tamper output (TOUT) control for
 *              the specified Tamper IO
 *              获取指定防篡改 IO 的当前输出源
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     The output source of the tamper IO
 *              当前输出源
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_OUTPUT_SOURCE
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_OUTPUT_SOURCE
DL_LFSS_TamperIO_getOutputSource(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 TOUTSEL 位域并转换为枚举
    return ((DL_LFSS_TAMPERIO_OUTPUT_SOURCE)(
        lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
        LFSS_TIOCTL_TOUTSEL_MASK));
}

/**
 *  @brief      Selects the filter width for the digital glitch filter for
 *              the specified Tamper IO
 *              设置指定防篡改 IO 的数字毛刺滤波器宽度
 *
 *  The tamper event detection allows to configure one or more tamper IO’s to
 *  trigger a timestamp event and to generate an interrupt to the CPU. To
 *  minimize false triggers, a digital filter circuit is inserted into the IO
 *  path. Only pulses that are longer than the configured filter width will be
 *  registered as a tamper event.
 *  防篡改事件检测可配置一个或多个 IO 触发时间戳事件和 CPU 中断。
 *  为减少误触发，IO 路径中插入了数字滤波电路，
 *  仅宽度大于配置值的脉冲才会被识别为篡改事件。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 *  @param[in]  width     The width of the digital glitch filter. Pulses
 *                        smaller than this width will be filtered.
 *                        One of @ref DL_LFSS_TAMPERIO_GLITCH_FILTER_WIDTH.
 *                        毛刺滤波宽度，小于此宽度的脉冲将被过滤
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setGlitchFilterWidth(LFSS_Regs *lfss,
    DL_LFSS_TAMPERIO tamperIO, DL_LFSS_TAMPERIO_GLITCH_FILTER_WIDTH width)
{
    // 用 FILTEREN 掩码更新滤波宽度位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO],
        (uint32_t) width, LFSS_TIOCTL_FILTEREN_MASK);
}

/**
 *  @brief      Gets the filter width for the digital glitch filter for
 *              the specified Tamper IO
 *              获取指定防篡改 IO 的毛刺滤波器宽度
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     The digital glitch filter width
 *              当前毛刺滤波宽度
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_GLITCH_FILTER_WIDTH
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_GLITCH_FILTER_WIDTH
DL_LFSS_TamperIO_getGlitchFilterWidth(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 FILTEREN 位域并转换为枚举
    return ((DL_LFSS_TAMPERIO_GLITCH_FILTER_WIDTH)(
        lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
        LFSS_TIOCTL_FILTEREN_MASK));
}

/**
 *  @brief      Selects the edge detection polarity for the specified Tamper IO
 *              设置指定防篡改 IO 的边沿检测极性
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 *  @param[in]  polarity  The edge detection polarity.
 *                        One of @ref DL_LFSS_TAMPERIO_EDGE_DETECTION_POLARITY.
 *                        边沿检测极性选择
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setEdgeDetectionPolarity(LFSS_Regs *lfss,
    DL_LFSS_TAMPERIO tamperIO,
    DL_LFSS_TAMPERIO_EDGE_DETECTION_POLARITY polarity)
{
    // 用 POLARITY 掩码更新边沿检测极性位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO],
        (uint32_t) polarity, LFSS_TIOCTL_POLARITY_MASK);
}

/**
 *  @brief      Gets the edge detection polarity for the specified Tamper IO
 *              获取指定防篡改 IO 的边沿检测极性
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     The edge detection polarity for the specified Tamper IO
 *              当前边沿检测极性
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_EDGE_DETECTION_POLARITY
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_EDGE_DETECTION_POLARITY
DL_LFSS_TamperIO_getEdgeDetectionPolarity(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 POLARITY 位域并转换为枚举
    return ((DL_LFSS_TAMPERIO_EDGE_DETECTION_POLARITY)(
        lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
        LFSS_TIOCTL_POLARITY_MASK));
}

/**
 *  @brief      Enable internal pull-up resistor for the specified Tamper IO
 *              使能指定防篡改 IO 的内部上拉电阻
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO.
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableInternalPullUp(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 置位 PIPU 位使能内部上拉
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] |=
        LFSS_TIOCTL_PIPU_ENABLE;
}

/**
 *  @brief      Checks if internal pull-up resistor is enabled for the specified
 *              Tamper IO
 *              检查指定防篡改 IO 的内部上拉电阻是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     Returns the internal pull-up resistor enabled status
 *              返回内部上拉电阻使能状态
 *
 *  @retval     true  Internal pull-up resistor for the Tamper I/O is enabled 上拉已使能
 *  @retval     false Internal pull-up resistor for the Tamper I/O is disabled 上拉已禁用
 */
__STATIC_INLINE bool DL_LFSS_TamperIO_isInternalPullUpEnabled(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 PIPU 位并与使能值比较
    return ((lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
                LFSS_TIOCTL_PIPU_MASK) == LFSS_TIOCTL_PIPU_ENABLE);
}

/**
 *  @brief      Disable internal pull-up resistor for the specified Tamper IO
 *              禁用指定防篡改 IO 的内部上拉电阻
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableInternalPullUp(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 清除 PIPU 位禁用内部上拉
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &=
        ~(LFSS_TIOCTL_PIPU_MASK);
}

/**
 *  @brief      Enable internal pull-down resistor for the specified Tamper IO
 *              使能指定防篡改 IO 的内部下拉电阻
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO.
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableInternalPullDown(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 置位 PIPD 位使能内部下拉
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] |=
        LFSS_TIOCTL_PIPD_ENABLE;
}

/**
 *  @brief      Checks if internal pull-down resistor is enabled for the specified
 *              Tamper IO
 *              检查指定防篡改 IO 的内部下拉电阻是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     Returns the internal pull-down resistor enabled status
 *              返回内部下拉电阻使能状态
 *
 *  @retval     true  Internal pull-down resistor for the Tamper I/O is enabled 下拉已使能
 *  @retval     false Internal pull-down resistor for the Tamper I/O is disabled 下拉已禁用
 */
__STATIC_INLINE bool DL_LFSS_TamperIO_isInternalPullDownEnabled(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 PIPD 位并与使能值比较
    return ((lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
                LFSS_TIOCTL_PIPD_MASK) == LFSS_TIOCTL_PIPD_ENABLE);
}

/**
 *  @brief      Disable internal pull-down resistor for the specified Tamper IO
 *              禁用指定防篡改 IO 的内部下拉电阻
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableInternalPullDown(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 清除 PIPD 位禁用内部下拉
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &=
        ~(LFSS_TIOCTL_PIPD_MASK);
}

/**
 *  @brief      Enable input path for the specified Tamper IO
 *              使能指定防篡改 IO 的输入通路
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO.
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableInput(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 置位 INENA 位使能输入通路
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] |=
        LFSS_TIOCTL_INENA_ENABLE;
}

/**
 *  @brief      Checks if input is enabled for the specified Tamper IO
 *              检查指定防篡改 IO 的输入通路是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     Returns the input enabled status
 *              返回输入通路使能状态
 *
 *  @retval     true  Input for the Tamper I/O is enabled 输入已使能
 *  @retval     false Input for the Tamper I/O is disabled 输入已禁用
 */
__STATIC_INLINE bool DL_LFSS_TamperIO_isInputEnabled(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 INENA 位并与使能值比较
    return ((lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
                LFSS_TIOCTL_INENA_MASK) == LFSS_TIOCTL_INENA_ENABLE);
}

/**
 *  @brief      Disable input path for the specified Tamper IO
 *              禁用指定防篡改 IO 的输入通路
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableInput(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 清除 INENA 位禁用输入通路
    lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &=
        ~(LFSS_TIOCTL_INENA_MASK);
}

/**
 *  @brief      Selects the mode for the specified Tamper IO
 *              设置指定防篡改 IO 的工作模式
 *
 * The tamper IOs have two modes of operation:
 *     - In IOMUX mode (@ref DL_LFSS_TAMPERIO_MODE_IOMUX), the tamper IO input
 *         and output path are connected to the SoC IOMUX module and the IO can
 *         be used as a second function.
 *     - In tamper mode (@ref DL_LFSS_TAMPERIO_MODE_TAMPER), the tamper IO is
 *         completely controlled by the VBAT IP and will remain functional
 *         during the power loss of the main supply or during SHUTDOWN mode.
 *  防篡改 IO 有两种工作模式：
 *     - IOMUX 模式：IO 连接到 SoC IOMUX 模块，可作为第二功能引脚
 *     - 防篡改模式：由 VBAT IP 完全控制，主电源掉电或 SHUTDOWN 模式下仍可工作
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO to configure.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要配置的防篡改 IO 编号
 *  @param[in]  mode      The mode for the specified tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO_MODE.
 *                        工作模式选择
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setMode(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO, DL_LFSS_TAMPERIO_MODE mode)
{
    // 用 IOMUX 掩码更新模式选择位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO],
        (uint32_t) mode, LFSS_TIOCTL_IOMUX_MASK);
}

/**
 *  @brief      Gets the mode for the specified Tamper IO
 *              获取指定防篡改 IO 的当前工作模式
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     The mode for the specified Tamper IO
 *              当前工作模式
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_MODE
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_MODE DL_LFSS_TamperIO_getMode(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    // 读取 IOMUX 位域并转换为枚举
    return ((DL_LFSS_TAMPERIO_MODE)(
        lfss->IPSPECIFIC_TIO.TIOCTL[(uint32_t) tamperIO] &
        LFSS_TIOCTL_IOMUX_MASK));
}

