zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lfss.h
/**
 *  @brief      Enable data output for the specified Tamper IO
 *              使能指定防篡改 IO 的数据输出
 *
 *  @param[in]  lfss       Pointer to the register overlay for the LFSS peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO   Specifies the tamper IO to configure.
 *                         One of @ref DL_LFSS_TAMPERIO.
 *                         要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableOutput(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_TIO.TOE3_0;

    /* Point to correct base register */
    // 每个寄存器管理 4 个 IO，根据编号偏移到对应寄存器
    pReg = (uint32_t *) ((uint8_t *) pReg + (uint8_t)(4 * (tamperIO / 4)));

    /* Set just the one bit for the specified tamper IO */
    // 每个 IO 占 8 位，计算位偏移并置位使能位
    *pReg |= LFSS_TAMPER_IO_PIN_ENABLE << (8 * (tamperIO % 4));
}

/**
 *  @brief      Disable data output for the specified Tamper IO
 *              禁用指定防篡改 IO 的数据输出
 *
 *  @param[in]  lfss       Pointer to the register overlay for the LFSS peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO   Specifies the tamper IO to configure.
 *                         One of @ref DL_LFSS_TAMPERIO.
 *                         要配置的防篡改 IO 编号
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableOutput(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_TIO.TOE3_0;

    /* Point to correct base register */
    // 每个寄存器管理 4 个 IO，根据编号偏移到对应寄存器
    pReg = (uint32_t *) ((uint8_t *) pReg + (uint8_t)(4 * (tamperIO / 4)));

    /* Clear just the one bit for the specified tamper IO */
    // 计算位偏移并清除使能位
    *pReg &= ~(LFSS_TAMPER_IO_PIN_ENABLE << (8 * (tamperIO % 4)));
}

/**
 *  @brief      Checks if data output for the specified Tamper IO is enabled
 *              检查指定防篡改 IO 的数据输出是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     If data output for the specified Tamper IO is enabled
 *              返回数据输出使能状态
 *
 *  @retval     true   Data output for the tamper IO is enabled 输出已使能
 *  @retval     false  Data output for the tamper IO is disabled 输出已禁用
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_isOutputEnabled(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_TIO.TOE3_0;

    /* Point to correct base register */
    // 每个寄存器管理 4 个 IO，根据编号偏移到对应寄存器
    pReg = (uint32_t *) ((uint8_t *) pReg + (uint8_t)(4 * (tamperIO / 4)));

    volatile uint32_t pinMask = LFSS_TAMPER_IO_PIN_MASK
                                << (8 * (tamperIO % 4));
    volatile uint32_t enableMask = LFSS_TAMPER_IO_PIN_ENABLE
                                   << (8 * (tamperIO % 4));

    /* Get just the one bit for the specified tamper IO */
    // 提取对应位并与使能值比较
    return ((*pReg & pinMask) == enableMask);
}

/**
 *  @brief      Enable data output value as zero for the specified Tamper IO
 *              设置指定防篡改 IO 的输出数据值
 *
 *  @param[in]  lfss       Pointer to the register overlay for the LFSS peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO   Specifies the tamper IO to configure.
 *                         One of @ref DL_LFSS_TAMPERIO.
 *                         要配置的防篡改 IO 编号
 *  @param[in]  outVal     The data value to set the tamper IO output to.
 *                         One of @ref DL_LFSS_TAMPERIO_VALUE.
 *                         输出数据值(0 或 1)
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setOutputValue(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO, DL_LFSS_TAMPERIO_VALUE outVal)
{
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_TIO.TOUT3_0;

    /* Point to correct base register */
    // 每个寄存器管理 4 个 IO，根据编号偏移到对应寄存器
    pReg = (uint32_t *) ((uint8_t *) pReg + (uint8_t)(4 * (tamperIO / 4)));

    volatile uint32_t valueMask = outVal << (8 * (tamperIO % 4));
    volatile uint32_t pinMask   = LFSS_TAMPER_IO_PIN_MASK
                                << (8 * (tamperIO % 4));

    // 用掩码更新对应 IO 的输出值位
    DL_Common_updateReg(pReg, valueMask, pinMask);
}

/**
 *  @brief      Gets the output data value for the specified Tamper IO
 *              获取指定防篡改 IO 的输出数据值
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     The output data value for the specified tamper IO
 *              当前输出数据值
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_VALUE
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_VALUE DL_LFSS_TamperIO_getOutputValue(
    LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_TIO.TOUT3_0;

    /* Point to correct base register */
    // 每个寄存器管理 4 个 IO，根据编号偏移到对应寄存器
    pReg = (uint32_t *) ((uint8_t *) pReg + (uint8_t)(4 * (tamperIO / 4)));

    volatile uint32_t pinMask = LFSS_TAMPER_IO_PIN_MASK
                                << (8 * (tamperIO % 4));

    // 提取对应位并右移到最低位
    uint32_t outVal = (*pReg & pinMask) >> (8 * (tamperIO % 4));

    return (DL_LFSS_TAMPERIO_VALUE)(outVal);
}

/**
 *  @brief      Gets the input data value for the specified Tamper IO
 *              获取指定防篡改 IO 的输入数据值
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  tamperIO  Specifies the tamper IO.
 *                        One of @ref DL_LFSS_TAMPERIO
 *                        要查询的防篡改 IO 编号
 *
 *  @return     The input data value for the specified tamper IO
 *              当前输入数据值
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_VALUE
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_VALUE DL_LFSS_TamperIO_getInputValue(
    const LFSS_Regs *lfss, DL_LFSS_TAMPERIO tamperIO)
{
    const volatile uint32_t *pReg = &lfss->IPSPECIFIC_TIO.TIN3_0;

    /* Point to correct base register */
    // 每个寄存器管理 4 个 IO，根据编号偏移到对应寄存器
    pReg = (uint32_t *) ((uint8_t *) pReg + (uint8_t)(4 * (tamperIO / 4)));

    volatile uint32_t pinMask = LFSS_TAMPER_IO_PIN_MASK
                                << (8 * (tamperIO % 4));

    // 提取对应位并右移到最低位
    uint32_t inputVal = (*pReg & pinMask) >> (8 * (tamperIO % 4));

    return (DL_LFSS_TAMPERIO_VALUE)(inputVal);
}

/**
 *  @brief      Sets the interval for the heart beat generator
 *              设置心跳发生器的周期间隔
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  interval  The interval of the heart beat generator.
 *                        One of @ref DL_LFSS_HEARTBEAT_INTERVAL
 *                        心跳周期间隔
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setHeartBeatInterval(
    LFSS_Regs *lfss, DL_LFSS_HEARTBEAT_INTERVAL interval)
{
    // 用 HBINTERVAL 掩码更新心跳间隔位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.HEARTBEAT, (uint32_t) interval,
        LFSS_HEARTBEAT_HBINTERVAL_MASK);
}

/**
 *  @brief      Gets the interval for the heart beat generator
 *              获取心跳发生器的当前周期间隔
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *
 *  @return     The interval for the heart beat generator.
 *              当前心跳周期间隔
 *
 *  @retval     One of @ref DL_LFSS_HEARTBEAT_INTERVAL
 */
__STATIC_INLINE DL_LFSS_HEARTBEAT_INTERVAL
DL_LFSS_TamperIO_getHeartBeatInterval(const LFSS_Regs *lfss)
{
    // 读取 HBINTERVAL 位域并转换为枚举
    uint32_t interval =
        lfss->IPSPECIFIC_TIO.HEARTBEAT & LFSS_HEARTBEAT_HBINTERVAL_MASK;

    return (DL_LFSS_HEARTBEAT_INTERVAL)(interval);
}

/**
 *  @brief      Sets the pulse width for the heart beat generator
 *              设置心跳发生器的脉冲宽度
 *
 *  @param[in]  lfss   Pointer to the register overlay for the LFSS peripheral
 *                     LFSS 外设寄存器基地址指针
 *  @param[in]  width  The pulse width of the heart beat generator.
 *                     One of @ref DL_LFSS_HEARTBEAT_PULSE_WIDTH
 *                     心跳脉冲宽度
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setHeartBeatPulseWidth(
    LFSS_Regs *lfss, DL_LFSS_HEARTBEAT_PULSE_WIDTH width)
{
    // 用 HBWIDTH 掩码更新脉冲宽度位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.HEARTBEAT, (uint32_t) width,
        LFSS_HEARTBEAT_HBWIDTH_MASK);
}

/**
 *  @brief      Gets the pulse width for the heart beat generator
 *              获取心跳发生器的当前脉冲宽度
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *
 *  @return     The pulse width for the heart beat generator.
 *              当前心跳脉冲宽度
 *
 *  @retval     One of @ref DL_LFSS_HEARTBEAT_PULSE_WIDTH
 */
__STATIC_INLINE DL_LFSS_HEARTBEAT_PULSE_WIDTH
DL_LFSS_TamperIO_getHeartBeatPulseWidth(const LFSS_Regs *lfss)
{
    // 读取 HBWIDTH 位域并转换为枚举
    uint32_t width =
        (lfss->IPSPECIFIC_TIO.HEARTBEAT & LFSS_HEARTBEAT_HBWIDTH_MASK);

    return (DL_LFSS_HEARTBEAT_PULSE_WIDTH)(width);
}

/**
 *  @brief      Sets the mode for the heart beat generator
 *              设置心跳发生器的工作模式
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS peripheral
 *                    LFSS 外设寄存器基地址指针
 *  @param[in]  mode  The mode of the heart beat generator.
 *                    One of @ref DL_LFSS_HEARTBEAT_MODE
 *                    心跳工作模式
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setHeartBeatMode(
    LFSS_Regs *lfss, DL_LFSS_HEARTBEAT_MODE mode)
{
    // 用 HBMODE 掩码更新工作模式位
    DL_Common_updateReg(&lfss->IPSPECIFIC_TIO.HEARTBEAT, (uint32_t) mode,
        LFSS_HEARTBEAT_HBMODE_MASK);
}

/**
 *  @brief      Gets the pulse mode for the heart beat generator
 *              获取心跳发生器的当前工作模式
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *
 *  @return     The pulse mode for the heart beat generator.
 *              当前心跳工作模式
 *
 *  @retval     One of @ref DL_LFSS_HEARTBEAT_MODE
 */
__STATIC_INLINE DL_LFSS_HEARTBEAT_MODE DL_LFSS_TamperIO_getHeartBeatMode(
    const LFSS_Regs *lfss)
{
    // 读取 HBMODE 位域并转换为枚举
    uint32_t mode =
        (lfss->IPSPECIFIC_TIO.HEARTBEAT & LFSS_HEARTBEAT_HBMODE_MASK);

    return (DL_LFSS_HEARTBEAT_MODE)(mode);
}

/**
 *  @brief      Enable write protection lock of the TIOCTL and HEARTBEAT
 *              registers from accidental updates
 *              使能 TIOCTL 和 HEARTBEAT 寄存器的写保护锁
 *
 *  When enabled, the TIOCTL and HEARTBEAT registers will have read-only access.
 *  使能后，TIOCTL 和 HEARTBEAT 寄存器将变为只读。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableWriteProtectLock(LFSS_Regs *lfss)
{
    // 写入解锁密钥并置位保护位
    lfss->IPSPECIFIC_TIO.TIOLOCK =
        (LFSS_TIOLOCK_PROTECT_SET | LFSS_TIOLOCK_KEY_UNLOCK_W);
}

/**
 *  @brief      Checks if write protection lock of the TIOCTL and HEARTBEAT
 *              registers is enabled for the specified Tamper IO
 *              检查 TIOCTL 和 HEARTBEAT 寄存器的写保护锁是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *
 *  @return     Returns the enabled status of the write protection lock
 *              返回写保护锁使能状态
 *
 *  @retval     true  Write protection lock is enabled 写保护已使能
 *  @retval     false Write protection lock is disabled 写保护已禁用
 */
__STATIC_INLINE bool DL_LFSS_TamperIO_isWriteProtectLockEnabled(
    const LFSS_Regs *lfss)
{
    // 读取 PROTECT 位并与使能值比较
    return ((lfss->IPSPECIFIC_TIO.TIOLOCK & LFSS_TIOLOCK_PROTECT_MASK) ==
            LFSS_TIOLOCK_PROTECT_SET);
}

/**
 *  @brief      Disable write protection lock of the TIOCTL and HEARTBEAT
 *              registers
 *              禁用 TIOCTL 和 HEARTBEAT 寄存器的写保护锁
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableWriteProtectLock(LFSS_Regs *lfss)
{
    // 写入解锁密钥并清除保护位
    lfss->IPSPECIFIC_TIO.TIOLOCK =
        (LFSS_TIOLOCK_PROTECT_CLR | LFSS_TIOLOCK_KEY_UNLOCK_W);
}

/**
 * @brief Enables the Watchdog module
 *        使能独立看门狗模块
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_enableModule(LFSS_Regs *lfss)
{
    // 写入解锁密钥并置位使能位
    lfss->IPSPECIFIC_WDT.WDTEN =
        (LFSS_WDTEN_KEY_UNLOCK_W | LFSS_WDTEN_ENABLE_SET);
}

/**
 * @brief Disables the Watchdog module
 *        禁用独立看门狗模块
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_disableModule(LFSS_Regs *lfss)
{
    // 写入解锁密钥并清除使能位
    lfss->IPSPECIFIC_WDT.WDTEN =
        (LFSS_WDTEN_KEY_UNLOCK_W | LFSS_WDTEN_ENABLE_CLR);
}

/**
 * @brief Returns if Watchdog module is on
 *        检查独立看门狗模块是否已使能
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 * @return true  Watchdog is enabled 看门狗已使能
 * @return false Watchdog is disabled 看门狗已禁用
 */
__STATIC_INLINE bool DL_LFSS_IWDT_isModuleEnabled(const LFSS_Regs *lfss)
{
    // 读取 ENABLE 位并与使能值比较
    return ((lfss->IPSPECIFIC_WDT.WDTEN & LFSS_WDTEN_ENABLE_MASK) ==
            LFSS_WDTEN_ENABLE_SET);
}

/**
 * @brief Enables the Watchdog free run control
 *        使能看门狗自由运行模式
 *
 *  When enabled, the Watchdog will continue to free run and ignores the state
 *  of the CPU halted debug state
 *  使能后，看门狗在 CPU 暂停调试时仍继续运行。
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_enableFreeRun(LFSS_Regs *lfss)
{
    // 设置自由运行模式，调试暂停时看门狗不暂停
    lfss->IPSPECIFIC_WDT.WDTDBGCTL = LFSS_WDTDBGCTL_FREE_RUN;
}

/**
 * @brief Disables the Watchdog free run control
 *        禁用看门狗自由运行模式
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_disableFreeRun(LFSS_Regs *lfss)
{
    // 设置停止模式，调试暂停时看门狗也暂停
    lfss->IPSPECIFIC_WDT.WDTDBGCTL = LFSS_WDTDBGCTL_FREE_STOP;
}

/**
 * @brief Returns if Watchdog free run control is enabled
 *        检查看门狗自由运行模式是否已使能
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 * @return true  Watchdog free run control is enabled 自由运行已使能
 * @return false Watchdog free run control is disabled 自由运行已禁用
 */
__STATIC_INLINE bool DL_LFSS_IWDT_isFreeRunEnabled(const LFSS_Regs *lfss)
{
    // 读取 FREE 位并与自由运行值比较
    return ((lfss->IPSPECIFIC_WDT.WDTDBGCTL & LFSS_WDTDBGCTL_FREE_MASK) ==
            LFSS_WDTDBGCTL_FREE_RUN);
}

/**
 *  @brief      Sets the clock divider for the WDT module
 *              设置看门狗模块的时钟分频系数
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  divider   The WDT clock divider to set.
 *                        One of @ref DL_LFSS_IWDT_CLOCK_DIVIDE.
 *                        时钟分频系数
 */
__STATIC_INLINE void DL_LFSS_IWDT_setClockDivider(
    LFSS_Regs *lfss, DL_LFSS_IWDT_CLOCK_DIVIDE divider)
{
    // 用 CLKDIV 掩码更新分频位，同时写入解锁密钥
    DL_Common_updateReg(&lfss->IPSPECIFIC_WDT.WDTCTL,
        ((uint32_t) divider | LFSS_WDTCTL_KEY_UNLOCK_W),
        LFSS_WDTCTL_CLKDIV_MASK | LFSS_WDTCTL_KEY_MASK);
}

/**
 *  @brief      Gets the clock divider for the WDT module
 *              获取看门狗模块的当前时钟分频系数
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *
 *  @return     The clock divider for the WDT module
 *              当前时钟分频系数
 *
 *  @retval     One of @ref DL_LFSS_IWDT_CLOCK_DIVIDE
 */
__STATIC_INLINE DL_LFSS_IWDT_CLOCK_DIVIDE DL_LFSS_IWDT_getClockDivider(
    const LFSS_Regs *lfss)
{
    // 读取 CLKDIV 位域并转换为枚举
    uint32_t divider = (lfss->IPSPECIFIC_WDT.WDTCTL & LFSS_WDTCTL_CLKDIV_MASK);

    return (DL_LFSS_IWDT_CLOCK_DIVIDE)(divider);
}

/**
 *  @brief      Sets the timer period for the WDT module
 *              设置看门狗模块的定时器周期
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  period    The WDT timer period to set.
 *                        One of @ref DL_LFSS_IWDT_TIMER_PERIOD.
 *                        定时器周期选择
 */
__STATIC_INLINE void DL_LFSS_IWDT_setTimerPeriod(
    LFSS_Regs *lfss, DL_LFSS_IWDT_TIMER_PERIOD period)
{
    // 用 PER 掩码更新周期位，同时写入解锁密钥
    DL_Common_updateReg(&lfss->IPSPECIFIC_WDT.WDTCTL,
        ((uint32_t) period | LFSS_WDTCTL_KEY_UNLOCK_W),
        LFSS_WDTCTL_PER_MASK | LFSS_WDTCTL_KEY_MASK);
}

/*!
 *  @brief      Get the timer period for the WDT module
 *              获取看门狗模块的当前定时器周期
 *
 *  @param[in]  lfss  Pointer to the register overlay for peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @return     The current timer period for the WDT module
 *              当前定时器周期
 *
 *  @retval     One of @ref DL_LFSS_IWDT_TIMER_PERIOD
 */
__STATIC_INLINE DL_LFSS_IWDT_TIMER_PERIOD DL_LFSS_IWDT_getTimerPeriod(
    const LFSS_Regs *lfss)
{
    // 读取 PER 位域并转换为枚举
    uint32_t period = (lfss->IPSPECIFIC_WDT.WDTCTL & LFSS_WDTCTL_PER_MASK);

    return (DL_LFSS_IWDT_TIMER_PERIOD)(period);
}

/*!
 *  @brief      Restarts the Watchdog
 *              重启看门狗计数器(喂狗)
 *
 *  @param[in]  lfss  Pointer to the register overlay for peripheral
 *                    LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_restart(LFSS_Regs *lfss)
{
    // 写入重启值清零计数器，防止看门狗超时复位
    lfss->IPSPECIFIC_WDT.WDTCNTRST = LFSS_WDTCNTRST_RESTART_VALUE;
}

/**
 * @brief Returns if Watchdog module is running
 *        检查看门狗模块是否正在运行
 *
 * @param lfss        Pointer to the register overlay for the peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 * @return true  Watchdog module is running 看门狗正在运行
 * @return false Watchdog counter has stopped 看门狗计数器已停止
 */
__STATIC_INLINE bool DL_LFSS_IWDT_isWatchdogRunning(const LFSS_Regs *lfss)
{
    // 读取 RUN 位并与运行值比较
    return ((lfss->IPSPECIFIC_WDT.WDTSTAT & LFSS_WDTSTAT_RUN_MASK) ==
            LFSS_WDTSTAT_RUN_RUN);
}

/**
 *  @brief      Enable write protection lock of the WDTEN and WDTCTL
 *              registers from accidental updates
 *              使能 WDTEN 和 WDTCTL 寄存器的写保护锁
 *
 *  When enabled, the WDTEN and WDTCTL registers will have read-only access.
 *  使能后，WDTEN 和 WDTCTL 寄存器将变为只读。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_enableWriteProtect(LFSS_Regs *lfss)
{
    // 写入解锁密钥并置位保护位
    lfss->IPSPECIFIC_WDT.WDTLOCK =
        (LFSS_WDTLOCK_PROTECT_SET | LFSS_WDTLOCK_KEY_UNLOCK_W);
}

/**
 *  @brief      Checks if write protection lock of the WDTEN and WDTCTL
 *              registers is enabled
 *              检查 WDTEN 和 WDTCTL 寄存器的写保护锁是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *
 *  @return     Returns the enabled status of the write protection lock
 *              返回写保护锁使能状态
 *
 *  @retval     true  Write protection lock is enabled 写保护已使能
 *  @retval     false Write protection lock is disabled 写保护已禁用
 */
__STATIC_INLINE bool DL_LFSS_IWDT_isWriteProtectEnabled(const LFSS_Regs *lfss)
{
    // 读取 PROTECT 位并与使能值比较
    return ((lfss->IPSPECIFIC_WDT.WDTLOCK & LFSS_WDTLOCK_PROTECT_MASK) ==
            LFSS_WDTLOCK_PROTECT_SET);
}

/**
 *  @brief      Disable write protection lock of the WDTEN and WDTCTL
 *              registers
 *              禁用 WDTEN 和 WDTCTL 寄存器的写保护锁
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LFSS_IWDT_disableWriteProtect(LFSS_Regs *lfss)
{
    // 写入解锁密钥并清除保护位
    lfss->IPSPECIFIC_WDT.WDTLOCK =
        (LFSS_WDTLOCK_PROTECT_CLR | LFSS_WDTLOCK_KEY_UNLOCK_W);
}

/**
 *  @brief      Write a word in scratch pad memory
 *              向便签存储器写入一个 32 位字
 *
 *  The VBAT scratch pad memory is register based memory that will retain data
 *  as long as VBAT is supplied. Refer to the device TRM for details on the
 *  specific size and implementation of the scratch pad memory.
 *  VBAT 便签存储器是基于寄存器的存储器，只要 VBAT 供电即可保持数据。
 *
 *  This API wil write 32-bit data to the selected word in the scratch pad
 *  memory.
 *  本 API 将 32 位数据写入选定的便签存储器字。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word to write to.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        要写入的便签存储器字索引
 *  @param[in]  data      The 32-bit data to write to the specified scratch pad
 *                        memory word. Value in range of [0x0, 0xFFFFFFF].
 *                        要写入的 32 位数据
 */
__STATIC_INLINE void DL_LFSS_writeScratchPadData32(
    LFSS_Regs *lfss, DL_LFSS_SCRATCHPAD_MEM_WORD memIndex, uint32_t data)
{
    // 直接写入 SPMEM 对应字
    lfss->IPSPECIFIC_MEM.SPMEM[(uint32_t) memIndex] = data;
}

/**
 *  @brief      Write to a single byte in scratch pad memory
 *              向便签存储器写入单个字节
 *
 *  The VBAT scratch pad memory is register based memory that will retain data
 *  as long as VBAT is supplied. Refer to the device TRM for details on the
 *  specific size and implementation of the scratch pad memory.
 *  VBAT 便签存储器是基于寄存器的存储器，只要 VBAT 供电即可保持数据。
 *
 *  This API will write 8-bit data to the selected byte in the scratch pad
 *  memory. The byte to write to is given in context of the scratch pad memory
 *  word that contains that byte.
 *      For example, to write to BYTE5 of scratch pad memory, the user will call
 *      this API with parameters @ref DL_LFSS_SCRATCHPAD_MEM_WORD_1 and
 *      @ref DL_LFSS_SCRATCHPAD_MEM_BYTE_1.
 *  本 API 向便签存储器选定字节写入 8 位数据。
 *  例如：写入 BYTE5 时，使用 WORD_1 + BYTE_1 参数组合。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word to write to.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        要写入的便签存储器字索引
 *  @param[in]  byteIndex The specified scratch pad memory byte to write to.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *                        要写入的字节偏移
 *  @param[in]  data      The 8-bit data to write to the specified scratch pad
 *                        memory byte. Value in range of [0x0, 0xFF].
 *                        要写入的 8 位数据
 */

__STATIC_INLINE void DL_LFSS_writeScratchPadData8(LFSS_Regs *lfss,
    DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex, uint32_t data)
{
    /* Point to correct SPMEM word */
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMEM[(uint32_t) memIndex];

    /* Get the correct bit based on the byteIndex */
    // 计算字节在字内的位偏移(每字节 8 位)
    uint32_t offset = ((uint32_t) byteIndex * (uint32_t) 8);
    data            = data << offset;
    uint32_t mask   = ((uint32_t) 0x000000FFU) << offset;

    // 用掩码更新对应字节
    DL_Common_updateReg(pReg, data, mask);
}

