zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lfss.h
/**
 *  @brief      Read the specified word in scratch pad memory
 *              从便签存储器读取指定的 32 位字
 *
 *  The VBAT scratch pad memory is register based memory that will retain data
 *  as long as VBAT is supplied. Refer to the device TRM for details on the
 *  specific size and implementation of the scratch pad memory.
 *  VBAT 便签存储器是基于寄存器的存储器，只要 VBAT 供电即可保持数据。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word to read.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        要读取的便签存储器字索引
 *
 *  @return     The 32-bit data in the specified scratch pad memory word
 *              读取到的 32 位数据
 */
__STATIC_INLINE uint32_t DL_LFSS_readScratchPadDataWord(
    const LFSS_Regs *lfss, DL_LFSS_SCRATCHPAD_MEM_WORD memIndex)
{
    // 直接读取 SPMEM 对应字
    return (lfss->IPSPECIFIC_MEM.SPMEM[(uint32_t) memIndex]);
}

/**
 *  @brief      Read the specified byte in scratch pad memory
 *              从便签存储器读取指定的单个字节
 *
 *  The VBAT scratch pad memory is register based memory that will retain data
 *  as long as VBAT is supplied. Refer to the device TRM for details on the
 *  specific size and implementation of the scratch pad memory.
 *  VBAT 便签存储器是基于寄存器的存储器，只要 VBAT 供电即可保持数据。
 *
 *  This API will read 8-bit data from the selected byte in the scratch pad
 *  memory. The byte to read to is given in context of the scratch pad memory
 *  word that contains that byte.
 *      For example, to read BYTE5 of scratch pad memory, the user will call
 *      this API with parameters @ref DL_LFSS_SCRATCHPAD_MEM_WORD_1 and
 *      @ref DL_LFSS_SCRATCHPAD_MEM_BYTE_1.
 *  本 API 从便签存储器选定字节读取 8 位数据。
 *  例如：读取 BYTE5 时，使用 WORD_1 + BYTE_1 参数组合。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word to read.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        要读取的便签存储器字索引
 *  @param[in]  byteIndex The specified scratch pad memory byte to read.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *                        要读取的字节偏移
 *
 *  @return     The 8-bit data in the specified scratch pad memory byte
 *              读取到的 8 位数据
 */
__STATIC_INLINE uint8_t DL_LFSS_readScratchPadDataByte(LFSS_Regs *lfss,
    DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMEM word */
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMEM[(uint32_t) memIndex];

    /* Get the correct bit based on the byteIndex */
    // 计算字节在字内的位偏移并构造掩码
    uint32_t offset = ((uint32_t) byteIndex * (uint32_t) 8);
    uint32_t mask   = ((uint32_t) 0x000000FFU) << offset;

    // 提取对应字节并右移到最低位
    return (((*pReg & mask)) >> offset);
}

/**
 *  @brief     Enable write protection lock of the specified byte in scratch pad
 *             memory from accidental updates
 *             使能便签存储器指定字节的写保护
 *
 *  When enabled, the specified byte in scratch pad memory will have read-only
 *  access.
 *  使能后，指定字节将变为只读。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        便签存储器字索引
 *  @param[in]  byteIndex The specified byte in scratch pad memory word to
 *                        enable write protection for
 *                        要使能写保护的字节偏移
 */
__STATIC_INLINE void DL_LFSS_enableScratchPadWriteProtectByte(LFSS_Regs *lfss,
    DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMWPROT register */
    // 每个保护寄存器管理 4 个字(16 字节)，右移 2 位得到寄存器索引
    uint32_t regIndex       = (uint32_t) memIndex >> (uint32_t) 2;
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMWPROT0 + regIndex;

    /* Get the correct bit based on the byteIndex */
    // 计算目标字节在保护寄存器中的位位置
    uint32_t mask = (uint32_t) 1 << ((((uint32_t) memIndex % (uint32_t) 4)
                                         << (uint32_t) 2) +
                                     (uint32_t) byteIndex);

    // 写入解锁密钥并置位对应保护位
    *pReg |= (LFSS_SPMWPROT0_KEY_UNLOCK_W | mask);
}

/**
 *  @brief      Checks if write protection is enabled for the specified byte in
 *              scratch pad memory
 *              检查便签存储器指定字节的写保护是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        便签存储器字索引
 *  @param[in]  byteIndex The specified scratch pad memory byte.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *                        要查询的字节偏移
 *
 *  @return     Returns if write protection is enabled for the specified byte
 *              返回写保护使能状态
 *
 *  @retval     true  Write protection for the specified byte is enabled 写保护已使能
 *  @retval     false Write protection for the specified byte is disabled 写保护已禁用
 */
__STATIC_INLINE bool DL_LFSS_isScratchPadWriteProtectByteEnabled(
    LFSS_Regs *lfss, DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMWPROT index */
    // 每个保护寄存器管理 4 个字，右移 2 位得到寄存器索引
    uint32_t regIndex       = (uint32_t) memIndex >> (uint32_t) 2;
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMWPROT0 + regIndex;

    /* Get the correct bit based on the byteIndex */
    // 计算目标字节在保护寄存器中的位位置
    uint32_t mask = (uint32_t) 1 << ((((uint32_t) memIndex % (uint32_t) 4)
                                         << (uint32_t) 2) +
                                     (uint32_t) byteIndex);

    // 检查对应保护位是否置位
    return ((*pReg & mask) == mask);
}

/**
 *  @brief     Disable write protection lock of the specified byte in scratch
 *             pad memory
 *             禁用便签存储器指定字节的写保护
 *
 *  When disables, the specified byte in scratch pad memory will have read-only
 *  access.
 *  禁用后，指定字节可恢复读写访问。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        便签存储器字索引
 *  @param[in]  byteIndex The specified byte in scratch pad memory word to
 *                        disable write protection for.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *                        要禁用写保护的字节偏移
 */
__STATIC_INLINE void DL_LFSS_disableScratchPadWriteProtectByte(LFSS_Regs *lfss,
    DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMWPROT index */
    // 每个保护寄存器管理 4 个字，右移 2 位得到寄存器索引
    uint32_t regIndex       = (uint32_t) memIndex >> (uint32_t) 2;
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMWPROT0 + regIndex;

    /* Get the correct bit based on the byteIndex */
    // 计算目标字节在保护寄存器中的位位置
    uint32_t mask = (uint32_t) 1 << ((((uint32_t) memIndex % (uint32_t) 4)
                                         << (uint32_t) 2) +
                                     (uint32_t) byteIndex);

    // 写入解锁密钥并清除对应保护位
    *pReg = ((*pReg & (~mask)) | LFSS_SPMWPROT1_KEY_UNLOCK_W);
}

/**
 *  @brief     Enable tamper erase of the specified byte in scratch pad
 *             memory
 *             使能便签存储器指定字节的防篡改擦除功能
 *
 *  When enabled, the specified byte in scratch pad memory will be erased in the
 *  event of a tamper detect.
 *  使能后，检测到篡改事件时将自动擦除该字节。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        便签存储器字索引
 *  @param[in]  byteIndex The specified byte in scratch pad memory word to
 *                        enable tamper erase for.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *                        要使能篡改擦除的字节偏移
 */
__STATIC_INLINE void DL_LFSS_enableScratchPadTamperEraseByte(LFSS_Regs *lfss,
    DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMTERASE index */
    // 每个擦除寄存器管理 4 个字，右移 2 位得到寄存器索引
    uint32_t regIndex       = (uint32_t) memIndex >> (uint32_t) 2;
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMTERASE0 + regIndex;

    /* Get the correct bit based on the byteIndex */
    // 计算目标字节在擦除寄存器中的位位置
    uint32_t mask = (uint32_t) 1 << ((((uint32_t) memIndex % (uint32_t) 4)
                                         << (uint32_t) 2) +
                                     (uint32_t) byteIndex);

    // 写入解锁密钥并置位对应擦除使能位
    *pReg |= (LFSS_SPMTERASE0_KEY_UNLOCK_W | mask);
}

/**
 *  @brief      Checks if tamper erase is enabled for the specified byte in
 *              scratch pad memory
 *              检查便签存储器指定字节的篡改擦除是否已使能
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *  @param[in]  memIndex  The specified scratch pad memory word.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *  @param[in]  byteIndex The specified byte in scratch pad memory byte.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *
 *  @return     Returns if tamper erase is enabled for the specified byte
 *
 *  @retval     true  Tamper erase for the specified byte is enabled 篡改擦除已使能
 *  @retval     false tamper erase for the specified byte is disabled 篡改擦除已禁用
 */
__STATIC_INLINE bool DL_LFSS_isScratchPadTamperEraseByteEnabled(
    LFSS_Regs *lfss, DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMTERASE index */
    // 每个擦除寄存器管理 4 个字，右移 2 位得到寄存器索引
    uint32_t regIndex       = (uint32_t) memIndex >> (uint32_t) 2;
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMTERASE0 + regIndex;

    /* Get the correct bit based on the byteIndex */
    // 计算目标字节在擦除寄存器中的位位置
    uint32_t mask = (uint32_t) 1 << ((((uint32_t) memIndex % (uint32_t) 4)
                                         << (uint32_t) 2) +
                                     (uint32_t) byteIndex);

    // 检查对应擦除使能位是否置位
    return ((*pReg & mask) == mask);
}

/**
 *  @brief     Disable tamper erase of the specified byte in scratch pad memory
 *             禁用便签存储器指定字节的篡改擦除功能
 *
 *  The specified byte in scratch pad memory will not be erased in the event of
 *  a tamper detect.
 *  禁用后，篡改事件不会擦除该字节。
 *
 *  @param[in]  lfss      Pointer to the register overlay for the LFSS peripheral
 *                        LFSS 外设寄存器基地址指针
 *  @param[in]  memIndex  The specified scratch pad memory word to write to.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_WORD
 *                        便签存储器字索引
 *  @param[in]  byteIndex The specified byte in scratch pad memory word to
 *                        disable tamper erase for.
 *                        One of @ref DL_LFSS_SCRATCHPAD_MEM_BYTE
 *                        要禁用篡改擦除的字节偏移
 */
__STATIC_INLINE void DL_LFSS_disableScratchPadTamperEraseByte(LFSS_Regs *lfss,
    DL_LFSS_SCRATCHPAD_MEM_WORD memIndex,
    DL_LFSS_SCRATCHPAD_MEM_BYTE byteIndex)
{
    /* Point to correct SPMTERASE index */
    // 每个擦除寄存器管理 4 个字，右移 2 位得到寄存器索引
    uint32_t regIndex       = (uint32_t) memIndex >> (uint32_t) 2;
    volatile uint32_t *pReg = &lfss->IPSPECIFIC_MEM.SPMTERASE0 + regIndex;

    /* Get the correct bit based on the byteIndex */
    // 计算目标字节在擦除寄存器中的位位置
    uint32_t mask = (uint32_t) 1 << ((((uint32_t) memIndex % (uint32_t) 4)
                                         << (uint32_t) 2) +
                                     (uint32_t) byteIndex);

    // 写入解锁密钥并清除对应擦除使能位
    *pReg = ((*pReg & (~mask)) | LFSS_SPMWPROT2_KEY_UNLOCK_W);
}

/**
 *  @brief      Enable LFSS Tamper Interrupts
 *              使能 LFSS 防篡改中断
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Logical OR of
 *                             @ref DL_LFSS_TAMPERIO_INTERRUPT.
 *                             中断掩码，可按位或组合
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableInterrupt(
    LFSS_Regs *lfss, uint32_t interruptMask)
{
    // 置位 IMASK 中对应中断使能位
    lfss->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable LFSS Tamper interrupts
 *              禁用 LFSS 防篡改中断
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Logical OR of
 *                             @ref DL_LFSS_TAMPERIO_INTERRUPT
 *                             中断掩码，可按位或组合
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableInterrupt(
    LFSS_Regs *lfss, uint32_t interruptMask)
{
    // 清除 IMASK 中对应中断使能位
    lfss->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which LFSS Tamper interrupts are enabled
 *              查询哪些 LFSS 防篡改中断已使能
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_LFSS_TAMPERIO_INTERRUPT
 *                             要查询的中断掩码
 *
 *  @return     Which of the requested LFSS interrupts are enabled
 *              返回已使能的中断位
 *
 *  @retval     Logical OR of @ref DL_LFSS_TAMPERIO_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_getEnabledInterrupts(
    const LFSS_Regs *lfss, uint32_t interruptMask)
{
    // 读取 IMASK 并与查询掩码按位与
    return (lfss->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled LFSS Tamper interrupts
 *              查询已使能的 LFSS 防篡改中断的挂起状态
 *
 *  Checks if any of the LFSS Tamper interrupts that were previously enabled are
 *  pending.
 *  检查先前已使能的防篡改中断是否有待处理的中断请求。
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_LFSS_TAMPERIO_INTERRUPT
 *                             要查询的中断掩码
 *
 *  @return     Which of the requested LFSS Tamper interrupts are pending
 *              返回挂起的中断位
 *
 *  @retval     Logical OR of @ref DL_LFSS_TAMPERIO_INTERRUPT values
 *
 *  @sa         DL_LFSS_TAMPERIO_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_getEnabledInterruptStatus(
    const LFSS_Regs *lfss, uint32_t interruptMask)
{
    // 读取 MIS(已使能中断状态)寄存器并与查询掩码按位与
    return (lfss->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any LFSS Tamper interrupt
 *              查询任意 LFSS 防篡改中断的原始挂起状态
 *
 *  Checks if any of the LFSS Tamper interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *  检查防篡改中断是否有待处理请求，无需事先使能。
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_LFSS_TAMPERIO_INTERRUPT
 *                             要查询的中断掩码
 *
 *  @return     Which of the requested LFSS Tamper interrupts are pending
 *              返回原始挂起的中断位
 *
 *  @retval     Logical OR of @ref DL_LFSS_TAMPERIO_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_getRawInterruptStatus(
    const LFSS_Regs *lfss, uint32_t interruptMask)
{
    // 读取 RIS(原始中断状态)寄存器并与查询掩码按位与
    return (lfss->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending LFSS interrupt
 *              获取最高优先级的待处理 LFSS 中断
 *
 *  Checks if any of the LFSS interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *  检查是否有待处理的 LFSS 中断，无需事先使能。
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @return     The highest priority pending LFSS Tamper interrupt
 *              最高优先级待处理中断的索引
 *
 *  @retval     One of @ref DL_LFSS_TAMPERIO_IIDX
 */
__STATIC_INLINE DL_LFSS_TAMPERIO_IIDX DL_LFSS_TamperIO_getPendingInterrupt(
    const LFSS_Regs *lfss)
{
    // 读取 IIDX 寄存器获取最高优先级中断索引
    return (DL_LFSS_TAMPERIO_IIDX)(lfss->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending LFSS Tamper interrupts
 *              清除待处理的 LFSS 防篡改中断标志
 *
 *  @param[in]  lfss  Pointer to the register overlay for the LFSS Tamper peripheral
 *                    LFSS 外设寄存器基地址指针
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_LFSS_TAMPERIO_INTERRUPT
 *                             要清除的中断掩码
 */
__STATIC_INLINE void DL_LFSS_TamperIO_clearInterruptStatus(
    LFSS_Regs *lfss, uint32_t interruptMask)
{
    // 写入 ICLR 寄存器清除对应中断标志
    lfss->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief      Enable LFSS Tamper event
 *              使能 LFSS 防篡改事件
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  eventMask   Bit mask of interrupts to enable. Bitwise OR of
 *                          @ref DL_LFSS_TAMPERIO_EVENT.
 *                          事件掩码，可按位或组合
 */
__STATIC_INLINE void DL_LFSS_TamperIO_enableEvent(
    LFSS_Regs *lfss, uint32_t eventMask)
{
    // 置位 GEN_EVENT.IMASK 中对应事件使能位
    lfss->GEN_EVENT.IMASK |= (eventMask);
}

/**
 *  @brief      Disable LFSS Tamper event
 *              禁用 LFSS 防篡改事件
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  eventMask   Bit mask of interrupts to enable. Bitwise OR of
 *                          @ref DL_LFSS_TAMPERIO_EVENT.
 *                          事件掩码，可按位或组合
 */
__STATIC_INLINE void DL_LFSS_TamperIO_disableEvent(
    LFSS_Regs *lfss, uint32_t eventMask)
{
    // 清除 GEN_EVENT.IMASK 中对应事件使能位
    lfss->GEN_EVENT.IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which LFSS Tamper events are enabled
 *              查询哪些 LFSS 防篡改事件已使能
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_LFSS_TAMPERIO_EVENT.
 *                          要查询的事件掩码
 *
 *  @return     Which of the requested LFSS Tamper interrupts are enabled
 *              返回已使能的事件位
 *
 *  @retval     Bitwise OR of @ref DL_LFSS_TAMPERIO_EVENT values
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_getEnabledEvents(
    const LFSS_Regs *lfss, uint32_t eventMask)
{
    // 读取 GEN_EVENT.IMASK 并与查询掩码按位与
    return ((lfss->GEN_EVENT.IMASK) & (eventMask));
}

/**
 *  @brief      Check event flag of enabled LFSS Tamper event
 *              查询已使能的 LFSS 防篡改事件的挂起状态
 *
 *  Checks if any of the LFSS Tamper events that were previously enabled are
 *  pending.
 *  检查先前已使能的防篡改事件是否有待处理的事件。
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_LFSS_TAMPERIO_EVENT.
 *                          要查询的事件掩码
 *
 *  @return     Which of the requested LFSS Tamper interrupts are pending
 *              返回挂起的事件位
 *
 *  @retval     Bitwise OR of @ref DL_LFSS_TAMPERIO_EVENT values
 *
 *  @sa         DL_LFSS_TamperIO_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_getEnabledEventStatus(
    const LFSS_Regs *lfss, uint32_t eventMask)
{
    // 读取 GEN_EVENT.MIS(已使能事件状态)并按位与
    return ((lfss->GEN_EVENT.MIS) & eventMask);
}

/**
 *  @brief      Check interrupt flag of any LFSS Tamper event
 *              查询任意 LFSS 防篡改事件的原始挂起状态
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *  检查防篡改事件是否有待处理请求，无需事先使能。
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_LFSS_TAMPERIO_EVENT.
 *                          要查询的事件掩码
 *
 *  @return     Which of the requested LFSS Tamper interrupts are pending
 *              返回原始挂起的事件位
 *
 *  @retval     Bitwise OR of @ref DL_LFSS_TAMPERIO_EVENT values
 */
__STATIC_INLINE uint32_t DL_LFSS_TamperIO_getRawEventsStatus(
    const LFSS_Regs *lfss, uint32_t eventMask)
{
    // 读取 GEN_EVENT.RIS(原始事件状态)并按位与
    return ((lfss->GEN_EVENT.RIS) & eventMask);
}

/**
 *  @brief      Clear pending LFSS Tamper events
 *              清除待处理的 LFSS 防篡改事件标志
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  eventMask   Bit mask of interrupts to clear. Bitwise OR of
 *                          @ref DL_LFSS_TAMPERIO_EVENT.
 *                          要清除的事件掩码
 */
__STATIC_INLINE void DL_LFSS_TamperIO_clearEventsStatus(
    LFSS_Regs *lfss, uint32_t eventMask)
{
    // 写入 GEN_EVENT.ICLR 寄存器清除对应事件标志
    lfss->GEN_EVENT.ICLR |= (eventMask);
}

/**
 *  @brief Sets the LFSS Tamper event publisher channel ID
 *         设置 LFSS 防篡改事件发布者通道 ID
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 *                      通道 ID 号(0-15)，为 0 时断开发布者连接
 */
__STATIC_INLINE void DL_LFSS_TamperIO_setPublisherChanID(
    LFSS_Regs *lfss, uint8_t chanID)
{
    // 写入通道 ID 到 FPUB_0 寄存器
    lfss->FPUB_0 = (chanID & LFSS_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel ID
 *         获取 LFSS 防篡改事件发布者通道 ID
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *
 *  @return     Event publisher channel ID
 *              当前事件发布者通道 ID
 *
 */
__STATIC_INLINE uint8_t DL_LFSS_TamperIO_getPublisherChanID(
    const LFSS_Regs *lfss)
{
    // 读取 FPUB_0 寄存器并提取通道 ID
    return (uint8_t)(lfss->FPUB_0 & LFSS_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Requests a reset to the LFSS module
 *         请求 LFSS 模块复位
 *
 *  @param[in]  lfss       Pointer to the register overlay for the peripheral
 *                         LFSS 外设寄存器基地址指针
 *
 *
 */
__STATIC_INLINE void DL_LFSS_reset(LFSS_Regs *lfss)
{
    // 写入解锁密钥并置位 VBATPOR 复位位
    lfss->IPSPECIFIC_RTC.LFSSRST =
        (LFSS_LFSSRST_KEY_UNLOCK_W | LFSS_LFSSRST_VBATPOR_SET);
}

#ifdef __cplusplus
}
#endif
#endif /* __MSPM0_HAS_LFSS__ */
#endif /* ti_dl_dl_lfss__include */
/** @}*/
